[
  {
    "key": "1",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367609/AASF%20Website/SquarePic_20230110_21460645_dakklc.jpg",
    "heading": "Group Discussion",
    "tag": "Managerial",
    "content": "AASF's Group Discussion hones students' interpersonal and oratory skills through topic discussions in two rounds, facilitating better articulation and expression of opinions, enhancing their communication abilities."
  },
  {
    "key": "2",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673362519/AASF%20Website/IMG_20230110_202328_naab8m.jpg",
    "heading": "JAM - Jest A Minute",
    "tag": "Managerial",
    "content": "JAM - Just A Minute, a fun event where students will be given a topic and have to speak on it for a minute without any hesitation, repetition, or deviation. The event was a great way to improve students' communication skills and boost their confidence."
  },
  {
    "key": "3",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367609/AASF%20Website/SquarePic_20230110_21455143_afifww.jpg",
    "heading": "UI/UX Design hIQ",
    "tag": "Literary",
    "content": " AASF's UI/UX Design hIQ is a two-day event that introduces students to the fundamentals of UI/UX design. The first day was a workshop on Figma, a UI/UX design tool, and the second day was a design challenge. The event was a great way to improve students' designing skills and boost their confidence."
  },
  {
    "key": "6",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_213648_ic1j7o.jpg",
    "heading": "Case Study Challenge",
    "tag": "Technical",
    "content": "AASF's Case Study Challenge is a two-round event that tests students' analytical and problem-solving abilities. The first round was a written test, and the second round was a case study presentation. The event was a great way to improve students' communication skills and boost their confidence."
  },
  {
    "key": "4",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367609/AASF%20Website/IMG_20230110_213847_pofk3c.jpg",
    "heading": "Web Week - Frontend",
    "tag": "Technical",
    "content": "Web Week - Frontend part introduces students to all the important concepts of developing a website's frontend, i.e. the part of a website the users interact with. The topics covered in this week were: History of Web, Hypertext Markup Language (HTML5), Cascading Style Sheets (CSS3), JavaScript (JS)."
  },
  {
    "key": "5",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367609/AASF%20Website/IMG_20230110_213825_oyfg29.jpg",
    "heading": "Web Week - Backend",
    "tag": "Technical",
    "content": "Web Week - Backend phase of the event, introduces students to all the key ideas of the backend (also known as server-side), the part of the website you don't see. Its responsibilities include data manipulation and organization, providing APIs as per the client-side functionality. user management, etc."
  },
  {
    "key": "7",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367610/AASF%20Website/IMG_20230110_213803_lac7ww.jpg",
    "heading": "Unravelling Research",
    "tag": "Literary",
    "content": "For the first time, AASF hosted a research-focused event, where they gained valuable insight by listening to the organisers discuss their research internship experiences. Additionally, they also showed how to take advantage of some excellent research possibilities both domestically and internationally."
  },
  {
    "key": "8",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367609/AASF%20Website/IMG_20230110_213942_nnzh08.jpg",
    "heading": "Bash hIQ",
    "tag": "Technical",
    "content": "It is found that being able to use the terminal rather than relying on GUIs gives you more flexibility, which is why AASF conducted a hIQ on Bash to help students get to know this powerful tool. Bash is a legitimate interface to your computer, and it's not just for server admins and programmers."
  },
  {
    "key": "9",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Introduction to C++",
    "tag": "Technical",
    "content": "AASF hosts an introductory session on C++ over the course of four days to get freshers acquainted with this all-purpose language. This session will assisted in learning and brushing up the fundamentals of C++, as well as providing an overview of emerging concepts."
  },
  {
    "key": "10",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Graphic Designing",
    "tag": "Technical",
    "content": "AASF hosts engaging Graphic Designing workshops that nurture participants' creativity in visual communication, design principles, and image manipulation, empowering them to craft visually compelling content with finesse. "
  },
  {
    "key": "11",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Hardware Awareness & Linux Installation",
    "tag": "Technical",
    "content": "Students are provided with hands-on hardware orientation and practical guidance for Linux installation, empowering participants to gain proficiency in assembling hardware components and successfully setting up Linux operating systems on various devices."
  },
  {
    "key": "12",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Guide to Open Source",
    "tag": "Technical",
    "content": "AASF offers a comprehensive guide to open-source, equipping participants with knowledge and strategies to contribute effectively to open-source projects, fostering collaboration, skill growth, and a deeper understanding of the open-source community."
  },
  {
    "key": "13",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Demystifying Blockchain",
    "tag": "Technical",
    "content": "AASF demystifies blockchain by providing participants with a clear understanding of its concepts and technologies, enabling them to navigate the intricacies of this transformative technology and its applications."
  },
  {
    "key": "14",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Intro to Git and GitHub",
    "tag": "Technical",
    "content": "AASF introduces participants to Git and GitHub, acquainting them with version control concepts and collaborative coding practices. This equips them with skills for effective team collaboration and efficient code management in real-world projects."
  },
  {
    "key": "15",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Roadmap to CP",
    "tag": "Technical",
    "content": "RoadMap to Competitive Programming guides participants through a structured journey of problem-solving challenges, algorithmic techniques, and coding practices, enhancing their ability to excel in competitive programming contests and real-world coding scenarios."
  },
  {
    "key": "16",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Introduction to Machine Learning",
    "tag": "Technical",
    "content": "Introduction to Machine Learning familiarizes participants with fundamental concepts and techniques in the field, enabling them to understand and apply machine learning algorithms for data analysis, prediction, and decision-making and grasp the principles and applications of machine learning in various domains.."
  },
  {
    "key": "17",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Weekly Junior Programming Sprints",
    "tag": "Technical",
    "content": "AASF's weekly junior programming sprints provides young participants with regular coding challenges, promoting consistent practice, skill development, and problem-solving abilities in a supportive learning environment."
  },
  {
    "key": "18",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Junior Programming Contests",
    "tag": "Technical",
    "content": "Junior programming contests organized by AASF engages young participants in coding challenges, fostering early exposure to problem-solving and programming skills, nurturing a strong foundation for their future in computer science and engineering."
  },
  {
    "key": "19",
    "image": "https://res.cloudinary.com/dzerj4bzd/image/upload/v1673367607/AASF%20Website/IMG_20230110_214332_cralgb.jpg",
    "heading": "Bi-Weekly DSA Contests",
    "tag": "Technical",
    "content": "AASF's bi-weekly DSA contests involves students in competitive coding challenges, enhancing their problem-solving and algorithmic skills while fostering a culture of continuous learning and improvement."
  }
]
